[

  {
    "category": "Beverages",
    "name": "Coffee",
    "description":"The traditional method of planting coffee is to place 20 seeds in each hole at the beginning of the rainy season. This method loses about 50% of the seeds' potential, as about half fail to sprout. A more effective process of growing coffee, used in Brazil, is to raise seedlings in nurseries that are then planted outside at six to twelve months. Coffee is often intercropped with food crops, such as corn, beans, or rice during the first few years of cultivation as farmers become familiar with its requirements.[45] Coffee plants grow within a defined area between the tropics of Cancer and Capricorn, termed the bean belt or coffee belt.[52]Of the two main species grown, arabica coffee (from C. arabica) is generally more highly regarded than robusta coffee (from C. canephora). Robusta coffee tends to be bitter and have less flavor but better body than arabica. For these reasons, about three-quarters of coffee cultivated worldwide is C. arabica.[42] Robusta strains also contain about 40–50% more caffeine than arabica.[53] Consequently, this species is used as an inexpensive substitute for arabica in many commercial coffee blends. Good quality robusta beans are used in traditional Italian espresso blends to provide a full-bodied taste and a better foam head (known as crema).Additionally, Coffea canephora is less susceptible to disease than C. arabica and can be cultivated in lower altitudes and warmer climates where C. arabica will not thrive.[54] The robusta strain was first collected in 1890 from the Lomani River, a tributary of the Congo River, and was conveyed from the Congo Free State (now the Democratic Republic of the Congo) to Brussels to Java around 1900. From Java, further breeding resulted in the establishment of robusta plantations in many countries.[55] In particular, the spread of the devastating coffee leaf rust (Hemileia vastatrix), to which C. arabica is vulnerable, hastened the uptake of the resistant robusta. Hemileia vastatrix is a fungal pathogen[56] and results in light, rust-colored spots on the undersides of coffee plant leaves. Hemileia vastatrix grows exclusively on the leaves of coffee pants.[57] Coffee leaf rust is found in virtually all countries that produce coffee.[58]Coffea robusta flowersA flowering Coffea arabica tree in a Brazilian plantationCoffea arabica berries on thebushFemale farm workers harvest coffee in a field, 1975Coffee berries on a plant in IndiaMycena citricolor is another threat to coffee plants, primarily in Latin America. Mycena citricolor, commonly referred to as American Leaf Spot, is a fungus that can affect the whole coffee plant.[59] It can grow on leaves, resulting in leaves with holes that often fall from the plant.[59]Over 900 species of insect have been recorded as pests of coffee crops worldwide. Of these, over a third are beetles, and over a quarter are bugs. Some 20 species of nematodes, 9 species of mites, and several snails and slugs also attack the crop. Birds and rodents sometimes eat coffee berries, but their impact is minor compared to invertebrates.[60] In general, arabica is the more sensitive species to invertebrate predation overall. Each part of the coffee plant is assailed by different animals. Nematodes attack the roots, coffee borer beetles burrow into stems and woody material,[61] and the foliage is attacked by over 100 species of larvae (caterpillars) of butterflies and moths.[62]Mass spraying of insecticides has often proven disastrous, as predators of the pests are more sensitive than the pests themselves.[63] Instead, integrated pest management has developed, using techniques such as targeted treatment of pest outbreaks, and managing crop environment away from conditions favouring pests. Branches infested with scale are often cut and left on the ground, which promotes scale parasites to not only attack the scale on the fallen branches but in the plant as well.[64]The 2-mm-long coffee borer beetle (Hypothenemus hampei) is the most damaging insect pest to the world's coffee industry, destroying up to 50 percent or more of the coffee berries on plantations in most coffee-producing countries. The adult female beetle nibbles a single tiny hole in a coffee berry and lays 35 to 50 eggs. Inside, the offspring grow, mate, and then emerge from the commercially ruined berry to disperse, repeating the cycle. Pesticides are mostly ineffective because the beetle juveniles are protected inside the berry nurseries, but they are vulnerable to predation by birds when they emerge. When groves of trees are nearby, the American yellow warbler, rufous-capped warbler, and other insectivorous birds have been shown to reduce by 50 percent the number of coffee berry borers in Costa Rica coffee plantations.[65]Beans from different countries or regions can usually be distinguished by differences in flavor, aroma, body, and acidity.[66] These taste characteristics are dependent not only on the coffee's growing region, but also on genetic subspecies (varietals) and processing.[67] Varietals are generally known by the region in which they are grown, such as Colombian, Java and Kona.Arabica coffee beans are cultivated mainly in Latin America, eastern Africa or Asia, while robusta beans are grown in central Africa, throughout southeast Asia, and Brazil.[42]Ecological effectsOriginally, coffee farming was done in the shade of trees that provided a habitat for many animals and insects.[68] Remnant forest trees were used for this purpose, but many species have been planted as well. These include leguminous trees of the genera Acacia, Albizia, Cassia, Erythrina, Gliricidia, Inga, and Leucaena, as well as the nitrogen-fixing non-legume sheoaks of the genus Casuarina, and the silky oak Grevillea robusta.[69]This method is commonly referred to as the traditional shaded method, or. Starting in the 1970s, many farmers switched their production method to sun cultivation, in which coffee is grown in rows under full sun with little or no forest canopy. This causes berries to ripen more rapidly and bushes to produce higher yields, but requires the clearing of trees and increased use of fertilizer and pesticides, which damage the environment and cause health problems.[70]Unshaded coffee plants grown with fertilizer yield the most coffee, although unfertilized shaded crops generally yield more than unfertilized unshaded crops: the response to fertilizer is much greater in full sun.[71] While traditional coffee production causes berries to ripen more slowly and produce lower yields, the quality of the coffee is allegedly superior.[72] In addition, the traditional shaded method provides living space for many wildlife species. Proponents of shade cultivation say environmental problems such as deforestation, pesticide pollution, habitat destruction, and soil and water degradation are the side effects of the practices employed in sun cultivation.[68][73]The American Birding Association, Smithsonian Migratory Bird Center,[74] National Arbor Day Foundation,[75] and the Rainforest Alliance have led a campaign for 'shade-grown' and organic coffees, which can be sustainably harvested.[76] Shaded coffee cultivation systems show greater biodiversity than full-sun systems, and those more distant from continuous forest compare rather poorly to undisturbed native forest in terms of habitat value for some bird species.[77][78]Coffee production use a large volume of water. On average it takes about 140 liters (37 U.S. gal) of water to grow the coffee beans needed to produce one cup of coffee, producing 1 kg (2.2 lb) of roasted coffee in Africa, South America or Asia requires 26,400 liters (7,000 U.S. gal) of water.[clarification needed][79] Coffee is often grown in countries where there is a water shortage, such as Ethiopia.[80]Used coffee grounds may be used for composting or as a mulch. They are especially appreciated by worms and acid-loving plants such as blueberries.[81] Some commercial coffee shops run initiatives to make better use of these grounds, including Starbucks' grounds for your Garden project,[82] and community sponsored initiatives such as Ground to Ground.[83]Climate change may significantly impact coffee yields during the 21st century, such as in Nicaragua and Ethiopia which could lose more than half of the farming land suitable for growing (Arabica) coffee.[84][85][86]As of 2016, at least 34% of global coffee production was compliant with voluntary sustainability standards such as Fairtrade, UTZ, and 4C (The Common Code for the Coffee Community).[87]"
  },
  {
    "category":"Beverages",
    "name":"Tea",
    "description":"Camellia sinensis is an evergreen plant that grows mainly in tropical and subtropical climates.[50] Some varieties can also tolerate marine climates and are cultivated as far north as Cornwall in England,[51] Perthshire in Scotland,[52] Washington in the United States,[53] and Vancouver Island in Canada.[54] In the Southern Hemisphere, tea is grown as far south as Hobart in Tasmania[55][56] and Waikato in New Zealand.[57]Tea plants are propagated from seed and cuttings; about 4 to 12 years are needed for a plant to bear seed and about three years before a new plant is ready for harvesting.[50] In addition to a zone 8 climate or warmer, tea plants require at least 127 cm (50 in) of rainfall per year and prefer acidic soils.[58] Many high-quality tea plants are cultivated at elevations of up to 1,500 m (4,900 ft) above sea level. Though at these heights the plants grow more slowly, they acquire a better flavour.[59]Two principal varieties are used: Camellia sinensis var. sinensis, which is used for most Chinese, Formosan and Japanese teas, and C. sinensis var. assamica, used in Pu-erh and most Indian teas (but not Darjeeling). Within these botanical varieties, many strains and modern clonal varieties are known. Leaf size is the chief criterion for the classification of tea plants, with three primary classifications being:[60] Assam type, characterised by the largest leaves; China type, characterised by the smallest leaves; and Cambodian type, characterised by leaves of intermediate size. The Cambodian-type tea (C. assamica subsp. lasiocaly) was originally considered a type of Assam tea. However, later genetic work showed that it is a hybrid between Chinese small-leaf tea and Assam-type tea.[61] Darjeeling tea also appears to be a hybrid between Chinese small-leaf tea and Assam-type large-leaf tea.[62]Women tea pickers in KenyaA tea plant will grow into a tree of up to 16 m (52 ft) if left undisturbed,[50] but cultivated plants are generally pruned to waist height for ease of plucking. Also, the short plants bear more new shoots which provide new and tender leaves and increase the quality of the tea.[63] Only the top 2.5–5 centimetres (1–2 in) of the mature plant are picked. These buds and leaves are called 'flushes'.[64] A plant will grow a new flush every 7 to 15 days during the growing season. Leaves that are slow in development tend to produce better-flavoured teas.[50] Several teas are available from specified flushes; for example, Darjeeling tea is available as first flush (at a premium price), second flush, monsoon and autumn. Assam second flush or tippy tea is considered superior to first flush, because of the gold tips that appear on the leaves.Pests that can afflict tea plants include mosquito bugs, genus Helopeltis, which are true bugs and not to be confused with dipterous insects of family Culicidae ('mosquitos'). Mosquito bugs can damage leaves both by sucking plant materials, and by the laying of eggs (oviposition) within the plant. Spraying with synthetic insecticides may be deemed appropriate.[65] Other pests are Lepidopteran leaf feeders and various tea diseases.Chemical composition"
  },  {
    "category": "Fruits",
    "name": "Apple",   
    "description":"An apple is an edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek, and European Christian tradition.  Apples grown from seed tend to be very different from those of the parents, and the resultant fruit frequently lack desired characteristics. Generally then, apple cultivars are propagated by clonal grafting onto rootstocks. Apple trees grown without rootstocks tend to be large and much slower to fruit after planting. Rootstocks are used to control speed of growth and the size of the resulting tree allowing for easier harvesting.  There are more than 7,500 known cultivars of apples. Different cultivars are bred for various tastes and use, including cooking, eating raw and cider production. Trees and fruit are prone to a number of fungal, bacterial and pest problems, which can be controlled by a number of organic and non-organic means. In 2010, the fruit's genome was sequenced as part of research on disease control and selective breeding in apple production.  Worldwide production of apples in 2018 was 86 million tonnes, with China accounting for nearly half of the total.[3]"
  },
  {
    "category": "Fruits",
    "name": "Orange",   
    "description":"The orange is the fruit of various citrus species in the family Rutaceae (see list of plants known as orange); it primarily refers to Citrus × sinensis,[1] which is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange. The sweet orange reproduces asexually (apomixis through nucellar embryony); varieties of sweet orange arise through mutations.[2][3][4][5]. The orange is a hybrid between pomelo (Citrus maxima) and mandarin (Citrus reticulata).[2][6] The chloroplast genome, and therefore the maternal line, is that of pomelo.[7] The sweet orange has had its full genome sequenced.[2] The orange originated in a region encompassing Southern China, Northeast India, and Myanmar,[8][9] and the earliest mention of the sweet orange was in Chinese literature in 314 BC.[2] As of 1987, orange trees were found to be the most cultivated fruit tree in the world.[10] Orange trees are widely grown in tropical and subtropical climates for their sweet fruit. The fruit of the orange tree can be eaten fresh, or processed for its juice or fragrant peel.[11] As of 2012, sweet oranges accounted for approximately 70% of citrus production.[12]. In 2019, 79 million tonnes of oranges were grown worldwide, with Brazil producing 22% of the total, followed by China and India.[13]"
  },
  {
    "category":"Fruits",
    "name":"banana",
    "description":"In regions such as North America and Europe, Musa fruits offered for sale can be divided into bananas and plantains, based on their intended use as food. Thus the banana producer and distributor Chiquita produces publicity material for the American market which says that a plantain is not a banana. The stated differences are that plantains are more starchy and less sweet; they are eaten cooked rather than raw; they have thicker skin, which may be green, yellow or black; and they can be used at any stage of ripeness.[38] Linnaeus made the same distinction between plantains and bananas when first naming two species of Musa.[39] Members of the plantain subgroup of banana cultivars, most important as food in West Africa and Latin America, correspond to the Chiquita description, having long pointed fruit. They are described by Ploetz et al. as true plantains, distinct from other cooking bananas.[40] The cooking bananas of East Africa belong to a different group, the East African Highland bananas,[13] so would not qualify as true plantains on this definition.Cavendish bananas are the most common dessert bananas soldAn alternative approach divides bananas into dessert bananas and cooking bananas, with plantains being one of the subgroups of cooking bananas.[41] Triploid cultivars derived solely from M. acuminata are examples of dessert bananas, whereas triploid cultivars derived from the hybrid between M. acuminata and M. balbisiana (in particular the plantain subgroup of the AAB Group) are plantains.[42][43] Small farmers in Colombia grow a much wider range of cultivars than large commercial plantations. A study of these cultivars showed that they could be placed into at least three groups based on their characteristics: dessert bananas, non-plantain cooking bananas, and plantains, although there were overlaps between dessert and cooking bananas.[44]In Southeast Asia – the center of diversity for bananas, both wild and cultivated – the distinction between bananas and plantains does not work, according to Valmayor et al. Many bananas are used both raw and cooked. There are starchy cooking bananas which are smaller than those eaten raw. The range of colors, sizes and shapes is far wider than in those grown or sold in Africa, Europe or the Americas.[39] Southeast Asian languages do not make the distinction between bananas and plantains that is made in English (and Spanish). Thus both Cavendish cultivars, the classic yellow dessert bananas, and Saba cultivars, used mainly for cooking, are called pisang in Malaysia and Indonesia, kluai in Thailand and chuoi in Vietnam.[45] Fe'i bananas, grown and eaten in the islands of the Pacific, are derived from entirely different wild species than traditional bananas and plantains. Most Fe'i bananas are cooked, but Karat bananas, which are short and squat with bright red skins, very different from the usual yellow dessert bananas, are eaten raw.[46]In summary, in commerce in Europe and the Americas (although not in small-scale cultivation), it is possible to distinguish between bananas, which are eaten raw, and plantains, which are cooked. In other regions of the world, particularly India, Southeast Asia and the islands of the Pacific, there are many more kinds of banana and the two-fold distinction is not useful and not made in local languages. Plantains are one of many kinds of cooking bananas, which are not always distinct from dessert bananas."
  },
    {
    "category":"Fruits",
    "name":"Coco",
    "description":"A cocoa pod (fruit) is about 17 to 20 cm (6.7 to 7.9 in) long and has a rough, leathery rind about 2 to 3 cm (0.79 to 1.18 in) thick (this varies with the origin and variety of pod) filled with sweet, mucilaginous pulp (called baba de cacao in South America) with a lemonade-like taste enclosing 30 to 50 large seeds that are fairly soft and a pale lavender to dark brownish purple color.During harvest, the pods are opened, the seeds are kept, and the empty pods are discarded and the pulp made into juice. The seeds are placed where they can ferment. Due to heat buildup in the fermentation process, cacao beans lose most of the purplish hue and become mostly brown in color, with an adhered skin which includes the dried remains of the fruity pulp. This skin is released easily by winnowing after roasting. White seeds are found in some rare varieties, usually mixed with purples, and are considered of higher value.[17][18]Harvesting Cocoa harvesting in CameroonCocoa trees grow in hot, rainy tropical areas within 20° of latitude from the Equator. Cocoa harvest is not restricted to one period per year and a harvest typically occurs over several months. In fact, in many countries, cocoa can be harvested at any time of the year.[10] Pesticides are often applied to the trees to combat capsid bugs, and fungicides to fight black pod disease.[19]Immature cocoa pods have a variety of colours, but most often are green, red, or purple, and as they mature, their colour tends towards yellow or orange, particularly in the creases.[10][20] Unlike most fruiting trees, the cacao pod grows directly from the trunk or large branch of a tree rather than from the end of a branch, similar to jackfruit. This makes harvesting by hand easier as most of the pods will not be up in the higher branches. The pods on a tree do not ripen together; harvesting needs to be done periodically through the year.[10] Harvesting occurs between three and four times weekly during the harvest season.[10] The ripe and near-ripe pods, as judged by their colour, are harvested from the trunk and branches of the cocoa tree with a curved knife on a long pole. Care must be used when cutting the stem of the pod to avoid damaging the junction of the stem with the tree, as this is where future flowers and pods will emerge.[10][21] One person can harvest an estimated 650 pods per day.[19][22]Harvest processingCocoa beans drying in the sunThe harvested pods are opened, typically with a machete, to expose the beans.[10][19] The pulp and cocoa seeds are removed and the rind is discarded. The pulp and seeds are then piled in heaps, placed in bins, or laid out on grates for several days. During this time, the seeds and pulp undergo sweating, where the thick pulp liquefies as it ferments. The fermented pulp trickles away, leaving cocoa seeds behind to be collected. Sweating is important for the quality of the beans,[23] which originally have a strong, bitter taste. If sweating is interrupted, the resulting cocoa may be ruined; if underdone, the cocoa seed maintains a flavor similar to raw potatoes and becomes susceptible to mildew. Some cocoa-producing countries distill alcoholic spirits using the liquefied pulp.[24A typical pod contains 30 to 40 beans and about 400 dried beans are required to make one pound (454 grams) of chocolate. Cocoa pods weigh an average of 400 g (14 oz) and each one yields 35 to 40 g (1.2 to 1.4 oz) dried beans; this yield is 9–10% of the total weight in the pod.[19] One person can separate the beans from about 2000 pods per day.[19][22]Close-up of drying cocoa beansThe wet beans are then transported to a facility so they can be fermented and dried.[19][22] The farmer removes the beans from the pods, packs them into boxes or heaps them into piles, then covers them with mats or banana leaves for three to seven days.[25] Finally, the beans are trodden and shuffled about (often using bare human feet) and sometimes, during this process, red clay mixed with water is sprinkled over the beans to obtain a finer color, polish, and protection against molds during shipment to factories in other countries. Drying in the sun is preferable to drying by artificial means, as no extraneous flavors such as smoke or oil are introduced which might otherwise taint the flavor.The beans should be dry for shipment, which is usually by sea. Traditionally exported in jute bags, over the last decade, beans are increasingly shipped in mega-bulk parcels of several thousand tonnes at a time on ships, or standardized to 62.5 kg per bag and 200 (12.5mt) or 240 (15mt) bags per 20-ft container. Shipping in bulk significantly reduces handling costs; shipment in bags, however, either in a ship's hold or in containers, is still common.Throughout Mesoamerica where they are native, cocoa beans are used for a variety of foods. The harvested and fermented beans may be ground to-order at tiendas de chocolate, or chocolate mills. At these mills, the cocoa can be mixed with a variety of ingredients such as cinnamon, chili peppers, almonds, vanilla, and other spices to create drinking chocolate.[26] The ground cocoa is also an important ingredient in tejate."
  },
    {
    "category":"Fruits",
    "name":"Mangoes",
    "description":"Mangoes are believed to have originated from the region between northwestern Myanmar, Bangladesh, and northeastern India.[1][2] The mango is considered an evolutionary anachronism, whereby seed dispersal was once accomplished by a now-extinct evolutionary forager, such as a megafauna mammal.[12]'Carabao', a typical Southeast Asian type polyembryonic mango cultivarFrom their center of origin, mangoes diverged into two genetically distinct populations: the subtropical Indian group and the tropical Southeast Asian group. The Indian group is characterized by having monoembryonic fruits, while the Southeast Asian group is characterized by polyembryonic fruits.[1][2]It was previously believed that mangoes originated from a single domestication event in South Asia before being spread to Southeast Asia, but a 2019 study found no evidence of a center of diversity in India. Instead it identified a higher unique genetic diversity in Southeast Asian cultivars than in Indian cultivars, indicating that mangoes may have originally been domesticated first in Southeast Asia before being introduced to South Asia. However, the authors also cautioned that the diversity in Southeast Asian mangoes may be the result of other reasons (like interspecific hybridization with other Mangifera species native to the Malesian ecoregion). Nevertheless, the existence of two distinct genetic populations also identified by the study indicates that the domestication of the mango is more complex than previously assumed, and would at least indicate multiple domestication events in Southeast Asia and South Asia.[1][2]'Langra', a typical Indian type monoembryonic mango cultivarFrom tropical Asia, mangoes were introduced to East Africa by Arab and Persian traders in the 9th to 10th centuries.[13] The 14th-century Moroccan traveler Ibn Battuta reported it at Mogadishu.[14] It was spread further into other areas around the world during the Colonial Era. The Portuguese Empire spread the mango from their colony in Goa to East and West Africa. From West Africa, they introduced it to Brazil from the 16th to the 17th centuries. From Brazil, it spread northwards to the Caribbean and eastern Mexico by the mid to late 18th century. The Spanish Empire also introduced mangoes directly from the Philippines to western Mexico via the Manila galleons from at least the 16th century. Mangoes were only introduced to Florida by 1833.[2][15]The mango is now cultivated in most frost-free tropical and warmer subtropical climates. It is cultivated extensively in South Asia, Southeast Asia, East and West Africa, the tropical and subtropical Americas, and the Caribbean.[16] Mangoes are also grown in Andalusia, Spain (mainly in Málaga province), as its coastal subtropical climate is one of the few places in mainland Europe that permits the growth of tropical plants and fruit trees. The Canary Islands are another notable Spanish producer of the fruit. Other minor cultivators include North America (in South Florida and the California Coachella Valley), Hawai'i, and Australia.[17]Many commercial cultivars are grafted on to the cold-hardy rootstock of Gomera-1 mango cultivar, originally from Cuba. Its root system is well adapted to a coastal Mediterranean climate.[18] Many of the 1,000+ mango cultivars are easily cultivated using grafted saplings, ranging from the turpentine mango (named for its strong taste of turpentine[19]) to the Bullock's Heart. Dwarf or semidwarf varieties serve as ornamental plants and can be grown in containers. A wide variety of diseases can afflict mangoes.[citation needed]An important breakthrough in mango cultivation is the use of potassium nitrate and ethrel to induce flowering in mangoes. The discovery was made by Filipino horticulturist Ramon Barba in 1974, and was developed from the unique traditional method of inducing mango flowering using smoke in the Philippines. It allowed mango plantations to induce regular flowering and fruiting year-round. Previously, mangoes were seasonal, because they only flowered every 16 to 18 months. The method is now used in most mango-producing countries.[20][21][22]"
  },
    {
    "category":"Fruits",
    "name":"Guavas",
    "description":"In Mexico and other Latin American countries, the popular beverage agua fresca is often made with guava. The entire fruit is a key ingredient in punch, and the juice is often used in culinary sauces (hot or cold), ales, candies, dried snacks, fruit bars, and desserts, or dipped in chamoy. Pulque de guava is a popular alcoholic beverage in these regions.In many countries, guava is eaten raw, typically cut into quarters or eaten like an apple; it is also eaten with a pinch of salt and pepper, cayenne powder or a mix of spices (masala). In the Philippines, ripe guava is used in cooking sinigang. Guava is a popular snack in Taiwan, sold on many street corners and night markets during hot weather, accompanied by packets of dried plum powder mixed with sugar and salt for dipping. In east Asia, guava is commonly eaten with sweet and sour dried plum powder mixtures. Guava juice is popular in many countries. The fruit is also often included in fruit salads.Because of its high level of pectin, guavas are extensively used to make candies, preserves, jellies, jams, and marmalades (such as Brazilian goiabada and Colombian and Venezuelan bocadillo), and as a marmalade jam served on toast.[2]Red guavas can be used as the base of salted products such as sauces, substituting for tomatoes, especially to minimize the acidity. A drink may be made from an infusion of guava fruits and leaves, which in Brazil is called chá-de-goiabeira, i.e., tea of guava tree leaves, considered medicinal."
  },
    {
    "category":"Fuits",
    "name":"Squashes",
    "description":""
  },
  {

    "category":"Fruits",
    "name":"Sugarcane",
    "description":"Sugarcane cultivation requires a tropical or subtropical climate, with a minimum of 60 cm (24 in) of annual moisture. It is one of the most efficient photosynthesizers in the plant kingdom. It is a C4 plant, able to convert up to 1% of incident solar energy into biomass.[30] In primary growing regions across the tropics and subtropics, sugarcane crops can produce over 15 kg/m2 of cane. Once a major crop of the southeastern region of the United States, sugarcane cultivation declined there during the late 20th century, and is primarily confined to small plantations in Florida, Louisiana, and southeast Texas in the 21st century. Sugarcane cultivation ceased in Hawaii when the last operating sugar plantation in the state shut down in 2016.[31]Sugarcane is cultivated in the tropics and subtropics in areas with a plentiful supply of water for a continuous period of more than 6–7 months each year, either from natural rainfall or through irrigation. The crop does not tolerate severe frosts. Therefore, most of the world's sugarcane is grown between 22°N and 22°S, and some up to 33°N and 33°S.[32] When sugarcane crops are found outside this range, such as the Natal region of South Africa, it is normally due to anomalous climatic conditions in the region, such as warm ocean currents that sweep down the coast. In terms of altitude, sugarcane crops are found up to 1,600 m or 5,200 ft close to the equator in countries such as Colombia, Ecuador, and Peru.[33]Sugarcane can be grown on many soils ranging from highly fertile, well-drained mollisols, through heavy cracking vertisols, infertile acid oxisols and ultisols, peaty histosols, to rocky andisols. Both plentiful sunshine and water supplies increase cane production. This has made desert countries with good irrigation facilities such as Egypt some of the highest-yielding sugarcane-cultivating regions. Sugarcane consumes 9% of the world's potash fertilizer production.[34]Although some sugarcanes produce seeds, modern stem cutting has become the most common reproduction method.[35] Each cutting must contain at least one bud, and the cuttings are sometimes hand-planted. In more technologically advanced countries, such as the United States and Australia, billet planting is common. Billets (stalks or stalk sections) harvested by a mechanical harvester are planted by a machine that opens and recloses the ground. Once planted, a stand can be harvested several times; after each harvest, the cane sends up new stalks, called ratoons. Successive harvests give decreasing yields, eventually justifying replanting. Two to 10 harvests are usually made depending on the type of culture. In a country with a mechanical agriculture looking for a high production of large fields, as in North America, sugarcanes are replanted after two or three harvests to avoid a lowering yields. In countries with a more traditional type of agriculture with smaller fields and hand harvesting, as in the French island la Réunion, sugarcane is often harvested up to 10 years before replanting.Sugarcane is harvested by hand and mechanically. Hand harvesting accounts for more than half of production, and is dominant in the developing world. In hand harvesting, the field is first set on fire. The fire burns up dry leaves, and chases away or kills venomous snakes, without harming the stalks and roots. Harvesters then cut the cane just above ground-level using cane knives or machetes. A skilled harvester can cut 500 kg (1,100 lb) of sugarcane per hour.[36]Mechanical harvesting uses a combine, or sugarcane harvester.[37] The Austoft 7000 series, the original modern harvester design, has now been copied by other companies, including Cameco / John Deere.[citation needed] The machine cuts the cane at the base of the stalk, strips the leaves, chops the cane into consistent lengths and deposits it into a transporter following alongside. The harvester then blows the trash back onto the field. Such machines can harvest 100 long tons (100 t) each hour, but harvested cane must be rapidly processed. Once cut, sugarcane begins to lose its sugar content, and damage to the cane during mechanical harvesting accelerates this decline. This decline is offset because a modern chopper harvester can complete the harvest faster and more efficiently than hand cutting and loading. Austoft also developed a series of hydraulic high-lift infield transporters to work alongside its harvesters to allow even more rapid transfer of cane to, for example, the nearest railway siding. This mechanical harvesting does not require the field to be set on fire; the residue left in the field by the machine consists of cane tops and dead leaves, which serve as mulch for the next planting."
  },
  
  {
    "category":"Grains",
    "name":"Jowar",
    "description":"The leading producers of S. bicolor in 2011 were Nigeria (12.6%), India (11.2%), Mexico (11.2%), and the United States (10.0%).[8] Sorghum grows in a wide range of temperatures, high altitudes, and toxic soils, and can recover growth after some drought.[6] It has five features that make it one of the most drought-resistant crops:It has a very large root-to-leaf surface area ratio.In times of drought, it rolls its leaves to lessen water loss by transpiration.If drought continues, it goes into dormancy rather than dying.Its leaves are protected by a waxy cuticle.It uses C4 carbon fixation thus using only a third the amount of water that C3 plants require.Sorghum grain cannot be consumed unless the indigestible husk is removed. During the transatlantic slave trade, the only way to remove the husk was byhand, with mortar and pestle.[9] Enslaved women did most of the work in preparing the sorghum and were tasked with cleaning the grain and turning it into flour.[9]"
  },  {
    "category": "Grains",
    "name": "Wheat",   
    "description": "Wheat is a grass widely cultivated for its seed, a cereal grain which is a worldwide staple   food.[2][3][4] The many species of wheat together make up the genus Triticum; the most widely grown is common wheat (T. aestivum). The archaeological record suggests that wheat was first cultivated in the regions of the Fertile Crescent around 9600 BCE. Botanically, the wheat kernel is a type of fruit called a caryopsis.  Wheat is grown on more land area than any other food crop (220.4 million hectares, 2014).[5] World trade in wheat is greater than for all other crops combined.[6] In 2017, world  production of wheat was 772 million tonnes, with a forecast of 2019 production at 766 million tonnes,[7] making it the second most-produced cereal after maize.[7][8] {'\n'}Since 1960, world production of wheat and other grain crops has tripled and is expected to grow further through the middle of the 21st century.[9] <br>         Global demand for wheat is increasing due to the unique viscoelastic and adhesive properties of gluten proteins, which facilitate the production of processed foods, whose consumption is increasing as a result of the worldwide industrialization process and the westernization of the diet.[10][11]    Wheat is an important source of carbohydrates.[10] Globally, it is the leading source of vegetable protein in human food, having a protein content of about 13%, which is relatively high compared to other major cereals[12] but relatively low in protein quality for supplying essential amino acids.[13][14] When eaten as the whole grain, wheat is a source of multiple nutrients and dietary fiber.[10] In a small part of the general population, gluten – the major part of wheat protein – can trigger coeliac disease, noncoeliac gluten sensitivity, gluten ataxia, and dermatitis herpetiformis."
      },
  {
    "category": "Grains",
    "name": "Rice",   
    "description": "Rice is the seed of the grass species Oryza sativa (Asian rice) or less commonly Oryza glaberrima (African rice). The name wild rice is usually used for species of the genera Zizania and Porteresia, both wild and domesticated, although the term may also be used for primitive or uncultivated varieties of Oryza. As a cereal grain, domesticated rice is the most widely consumed staple food for over half of the world's human population,[Liu 1] especially in Asia and Africa. It is the agricultural commodity with the third-highest worldwide production (rice, 741.5 million metric tons or 817.4 million short tons in 2014), after sugarcane (1.9 billion metric tons or 2.1 billion short tons) and maize (1.0 billion metric tons or 1.1 billion short tons).[1] Since sizable portions of sugarcane and maize crops are used for purposes other than human consumption, rice is the most important food crop with regard to human nutrition and caloric intake, providing more than one-fifth of the calories consumed worldwide by humans.[2] There are many varieties of rice and culinary preferences tend to vary regionally.Oryza sativa with small wind-pollinated flowers The traditional method for cultivating rice is flooding the fields while, or after, setting the young seedlings. This simple method requires sound irrigation planning but reduces the growth of less robust weed and pest plants that have no submerged growth state, and deters vermin. While flooding is not mandatory for the cultivation of rice, all other methods of irrigation require higher effort in weed and pest control during growth periods and a different approach for fertilizing the soil. Cooked brown rice from Bhutan Jumli Marshi, brown rice from Nepal. Rice can come in many shapes, colors and sizes. Rice, a monocot, is normally grown as an annual plant, although in tropical areas it can survive as a perennial and can produce a ratoon crop for up to 30 years.[3] Rice cultivation is well-suited to countries and regions with low labor costs and high rainfall, as it is labor-intensive to cultivate and requires ample water. However, rice can be grown practically anywhere, even on a steep hill or mountain area with the use of water-controlling terrace systems. Although its parent species are native to Asia and certain parts of Africa, centuries of trade and exportation have made it commonplace in many cultures worldwide."
  },
  {
    "category":"Grains",
    "name":"Bajra",
    "description":"Pearl millet is one of the two major crops in the semiarid, impoverished, less fertile agriculture regions of Africa and southeast Asia.[35] Millets are not only adapted to poor, droughty, and infertile soils, but they are also more reliable under these conditions than most other grain crops. This has, in part, made millet production popular, particularly in countries surrounding the Sahara in western Africa.[citation needed]Millets, however, do respond to high fertility and moisture. On a per-hectare basis, millet grain production can be 2–4 times higher with use of irrigation and soil supplements. Improved breeds of millet with enhanced disease resistance and can significantly increase farm yield. There has been cooperation between poor countries to improve millet yields. For example, 'Okashana 1', a variety developed in India from a natural-growing millet variety in Burkina Faso, doubled yields. This breed was selected for trials in Zimbabwe. From there it was taken to Namibia, where it was released in 1990 and enthusiastically adopted by farmers. 'Okashana 1' became the most popular variety in Namibia, the only non-Sahelian country where pearl millet—locally known as mahangu—is the dominant food staple for consumers. 'Okashana 1' was then introduced to Chad. The breed has significantly enhanced yields in Mauritania and Benin.[36]"
  },
    {
    "category":"Grains",
    "name":"Sorghum",
    "description":"One species, Sorghum bicolor,[7] native to Africa with many cultivated forms now,[8] is an important crop worldwide, used for food (as grain and in sorghum syrup or sorghum molasses), animal fodder, the production of alcoholic beverages, and biofuels. Sorghum's cultivation has been linked by archeological research back to ancient Sudan around 6,000 to 7,000 BP.[9]All sorghums contain phenolic acids, and most contain flavonoids.[10] Sorghum grains are one of the highest food sources of the flavonoid proanthocyanidin.[11] Total phenol content (in both phenolic acids and flavonoids) is correlated with antioxidant activity.[10] Antioxidant activity is high in sorghums having dark pericarp and pigmented testa.[10] The antioxidant activity of sorghum may explain the reduced incidence of certain cancers in populations consuming sorghum.[10]Popped sorghum is popular as a snack in India. The popped sorghum is similar to popcorn, but the puffs are smaller.[12] Recipes for popping sorghum by microwave, in a pot, etc., are readily available online.[13][12]In China, sorghum flour is used in combination with wheat flour to make noodles and breads.[14]Most varieties are drought- and heat-tolerant, nitrogen-efficient,[15] and are especially important in arid and semi-arid regions, where the grain is one of the staples for poor and rural people. These varieties form important components of forage in many tropical regions. S. bicolor is an important food crop in Africa, Central America, and South Asia, and is the 5th most important cereal crop grown in the world.[16][17]In the early stages of the plants' growth, some species of sorghum can contain levels of hydrogen cyanide, hordenine, and nitrates, which are lethal to grazing animals. When stressed by drought or heat, plants can also contain toxic levels of cyanide and nitrates at later stages in growth.[18][19]"
  },  {
    "category": "Spices",
    "name": "Clove",   
    "description":"Cloves are used in the cuisine of Asian, African, Mediterranean, and the Near and Middle East countries, lending flavor to meats, curries, and marinades, as well as fruit (such as apples, pears, and rhubarb). Cloves may be used to give aromatic and flavor qualities to hot beverages, often combined with other ingredients such as lemon and sugar. They are a common element in spice blends, including pumpkin pie spice and speculoos spices. In Mexican cuisine, cloves are best known as clavos de olor, and often accompany cumin and cinnamon.[4] They are also used in Peruvian cuisine, in a wide variety of dishes such as carapulcra and arroz con leche. A major component of clove taste is imparted by the chemical eugenol,[5] and the quantity of the spice required is typically small. It pairs well with cinnamon, allspice, vanilla, red wine, basil, onion, citrus peel, star anise, and peppercorns."
  },
    {
    "category":"Spices",
    "name":"Cardamom",
    "description":"In 1873 and 1874, Ceylon (now Sri Lanka) exported about 4,100 kg (9,000 lb) each year. In 1877, Ceylon exported 5,039 kg (11,108 lb), in 1879, 8,043 kg (17,732 lb), and in the 1881–2 season, 10,490 kg (23,127 lb)[31] In 1903, 1,600 hectares (4,000 acres) of cardamom growing areas were owned by European planters. The produce of the Travancore plantations was given as 290,000 kg (650,000 lb), or just a little under that of Ceylon. The yield of the Mysore plantations was approximately 91,000 kg (200,000 lb), and the cultivation was mainly in Kadur district. The volume for 1903-4 stated the value of the cardamoms exported to have been Rs. 3,37,000 as compared with Rs. 4,16,000 the previous year.[32] India, which ranks second in world production, recorded a decline of 6.7 percent in cardamom production for 2012–13,[33] and has projected a production decline of 30-40% in 2013–14, compared with the previous year due to unfavorable weather.[34] In India, the state of Kerala is by far the most productive producer, with the districts of Idukki, Palakkad and Wynad being the principal producing areas.[25] Given that a number of bureaucrats have personal interests in the industry, in India, several organisations have been set up to protect cardamom producers such as the Cardamom Growers Association (est. 1992) and the Kerala Cardamom Growers Association (est. 1974). Research in India's cardamom plantations began in the 1970s while Kizhekethil Chandy held the office of Chairman of the Cardamom Board.[35] The Kerala Land Reforms Act imposed restrictions on the size of certain agricultural holdings per household to the benefit of cardamom producers.[36]In 1979–1980, Guatemala surpassed India in worldwide production.[27] Guatemala cultivates Elettaria cardamomum, which is native to the Malabar Coast of India.[37] Alta Verapaz Department produces 70 percent of Guatemala's cardamom.[37] Cardamom was introduced to Guatemala before World War I by the German coffee planter Oscar Majus Kloeffer.[38] After World War II, production was increased to 13,000 to 14,000 tons annually.[25]Cardamom as a cash crop in Nepal's Terhathum DistrictIn addition to Guatemala and India, Sri Lanka, Nepal, Papua New Guinea and Tanzania are also significant growers of cardamom.[23] The average annual income for a plantation owning household in 1998 was US$3,408.[36] Although the typical harvest annually requires over 210 days of labor, most cardamom farmers are better off than many other agricultural workers, and there are a significant number of those from the upper strata of society involved in the cultivation process.[36] Increased demand since the 1980s, principally from China, for both Amomum villosum and Amomum tsao-ko, has provided a key source of income for poor farmers living at higher altitudes in localized areas of China, Laos, and Vietnam, people typically isolated from many other markets. Laos exports about 400 tonnes annually through Thailand according to the FAO.[39]"
  },
    {
    "category":"Spices",
    "name":"Nutmeg",
    "description":"Nutmeg and mace have similar sensory qualities, with nutmeg having a slightly sweeter and mace a more delicate flavour. Mace is often preferred in light dishes for the bright orange, saffron-like hue it imparts. Nutmeg is used for flavouring many dishes. Whole nutmeg can also be ground at home using a grater specifically designed for nutmeg[9] or a multi-purpose grating tool.[10]In Indonesian cuisine, nutmeg is used in various dishes,[11] mainly in many spicy soups, such as some variant of soto, konro, oxtail soup, sup iga (ribs soup), bakso and sup kambing. It is also used in gravy for meat dishes, such as semur beef stew, ribs with tomato, and European derived dishes such as bistik (beef steak), rolade (minced meat roll) and bistik lidah (beef tongue steak).In Indian cuisine, nutmeg is used in many sweet, as well as savoury, dishes. In Kerala Malabar region, grated nutmeg is used in meat preparations and also sparingly added to desserts for the flavour. It may also be used in small quantities in garam masala. Ground nutmeg is also smoked in India.[12]In traditional European cuisine, nutmeg and mace are used especially in potato dishes and in processed meat products; they are also used in soups, sauces, and baked goods. It is also commonly used in rice pudding. In Dutch cuisine, nutmeg is added to vegetables such as Brussels sprouts, cauliflower, and string beans. Nutmeg is a traditional ingredient in mulled cider, mulled wine, and eggnog. In Scotland, mace and nutmeg are usually both ingredients in haggis. In Italian cuisine, nutmeg is used as part of the stuffing for many regional meat-filled dumplings like tortellini, as well as for the traditional meatloaf. Nutmeg is a common spice for pumpkin pie and in recipes for other winter squashes, such as baked acorn squash. In the Caribbean, nutmeg is often used in drinks, such as the Bushwacker, Painkiller, and Barbados rum punch. Typically, it is a sprinkle on top of the drink."
  },
    {
    "category":"Spices",
    "name":"Garlic",
    "description":"Garlic is easy to grow and can be grown year-round in mild climates.[19] While sexual propagation of garlic is possible, nearly all of the garlic in cultivation is propagated asexually, by planting individual cloves in the ground.[13] In colder climates, cloves are best planted about six weeks before the soil freezes. The goal is to have the bulbs produce only roots and no shoots above the ground.[20] Harvest is in late spring or early summer.Garlic plants can be grown closely together, leaving enough space for the bulbs to mature, and are easily grown in containers of sufficient depth. Garlic does well in loose, dry, well-drained soils in sunny locations, and is hardy throughout USDA climate zones 4–9. When selecting garlic for planting, it is important to pick large bulbs from which to separate cloves. Large cloves, along with proper spacing in the planting bed, will also increase bulb size. Garlic plants prefer to grow in a soil with a high organic material content, but are capable of growing in a wide range of soil conditions and pH levels.[13]There are different varieties or subspecies of garlic, most notably hardneck garlic and softneck garlic.[19] The latitude where the garlic is grown affects the choice of type, as garlic can be day-length sensitive. Hardneck garlic is generally grown in cooler climates and produces relatively large cloves, whereas softneck garlic is generally grown closer to the equator and produces small, tightly packed cloves.[19]Garlic scapes are removed to focus all the garlic's energy into bulb growth. The scapes can be eaten raw or cooked.[21][22]Diseases Garlic plants are usually hardy and not affected by many pests or diseases. Garlic plants are said to repel rabbits and moles.[3] The California Department of Food and Agriculture (CDFA) conducts a certification program to assure freedom from nematode and white rot disease caused by Stromatinia cepivora, two pathogens that can both destroy a crop as well as remain in the soil indefinitely, once introduced.[13] Garlic may also suffer from pink root, a typically non-fatal disease that stunts the roots and turns them pink or red;[23] or leek rust.[19] The larvae of the leek moth attack garlic by mining into the leaves or bulbs.[24]"
  },
    {
    "category":"Spices",
    "name":"Turmeric",
    "description":"Turmeric is one of the key ingredients in many Asian dishes, imparting a mustard-like, earthy aroma and pungent, slightly bitter flavor to foods.[5][6] It is used mostly in savory dishes, but also is used in some sweet dishes, such as the cake sfouf. In India, turmeric leaf is used to prepare special sweet dishes, patoleo, by layering rice flour and coconut-jaggery mixture on the leaf, then closing and steaming it in a special utensil (chondrõ).[27] Most turmeric is used in the form of rhizome powder to impart a golden yellow color.[5][6] It is used in many products such as canned beverages, baked products, dairy products, ice cream, yogurt, yellow cakes, orange juice, biscuits, popcorn color, cereals, sauces, and gelatin. It is a principal ingredient in curry powders.[5][28] Although typically used in its dried, powdered form, turmeric also is used fresh, like ginger.[28] It has numerous uses in East Asian recipes, such as a pickle that contains large chunks of fresh soft turmeric.Turmeric is used widely as a spice in South Asian and Middle Eastern cooking. Various Iranian khoresh recipes begin with onions caramelized in oil and turmeric. The Moroccan spice mix ras el hanout typically includes turmeric. In South Africa, turmeric is used to give boiled white rice a golden color, known as geelrys (yellow rice) traditionally served with bobotie. In Vietnamese cuisine, turmeric powder is used to color and enhance the flavors of certain dishes, such as bánh xèo, bánh khọt, and mì Quảng. The staple Cambodian curry paste, kroeung, used in many dishes, including fish amok, typically contains fresh turmeric. In Indonesia, turmeric leaves are used for Minang or Padang curry base of Sumatra, such as rendang, sate padang, and many other varieties. In the Philippines, turmeric is used in the preparation and cooking of Kuning and Satay. In Thailand, fresh turmeric rhizomes are used widely in many dishes, in particular in the southern Thai cuisine, such as yellow curry and turmeric soup. Turmeric is used in a hot drink called turmeric latte or golden milk that is made with milk, frequently coconut milk.[29] The turmeric milk drink known as haldi doodh (haldi means turmeric in Hindi) is a traditional indian recipe. Sold in the US and UK, the drink known as golden milk uses nondairy milk and sweetener, and sometimes black pepper after the traditional recipe (which may also use ghee).[29]DyeThe golden yellow color of turmeric is due to curcumin.[4] It also contains an orange-colored volatile oil.[28] Turmeric makes a poor fabric dye, as it is not light fast, but is commonly used in Indian clothing, such as saris and Buddhist monks' robes.[6] It is used to protect food products from sunlight, coded as E100 when used as a food additive.[4][28] The oleoresin is used for oil-containing products.[4]In combination with annatto (E160b), turmeric has been used to color numerous food products.[4][28] Turmeric is used to give a yellow color to some prepared mustards, canned chicken broths, and other foods—often as a much cheaper replacement for saffron.[28][30]IndicatorTurmeric dispersed in water is yellow under acid and brown under alkaline conditionsTurmeric paper, also called curcuma paper or in German literature, Curcumapapier, is paper steeped in a tincture of turmeric and allowed to dry. It is used in chemical analysis as an indicator for acidity and alkalinity.[31] The paper is yellow in acidic and neutral solutions and turns brown to reddish-brown in alkaline solutions, with transition between pH of 7.4 and 9.2.[32]Traditional usesCurcuma domestica Valeton, a drawing by A. Bernecker around 1860Khandoba's newer temple in Jejuri, where devotees shower turmeric powder (bhandara) on each otherIn 2019, the European Medicines Agency concluded that turmeric herbal teas, or other forms taken by mouth, on the basis of their long-standing traditional use, could be used to relieve mild digestive problems, such as feelings of fullness and flatulence.[33]Turmeric grows wild in the forests of South and Southeast Asia, where it is collected for use in classical Indian medicine (Siddha or Ayurveda).[8] In Eastern India, the plant is used as one of the nine components of nabapatrika along with young plantain or banana plant, taro leaves, barley (jayanti), wood apple (bilva), pomegranate (darimba), Saraca indica, manaka (Arum), or manakochu, and rice paddy. The Haldi ceremony called gaye holud in Bengal (literally yellow on the body) is a ceremony observed during wedding celebrations of people of Indian culture all throughout the Indian subcontinent.[34]In Tamil Nadu and Andhra Pradesh, as a part of the Tamil–Telugu marriage ritual, dried turmeric tuber tied with string is used to create a Thali necklace. In western and coastal India, during weddings of the Marathi and Konkani people, Kannada Brahmins, turmeric tubers are tied with strings by the couple to their wrists during a ceremony, Kankana Bandhana.[35]Friedrich Ratzel reported in The History of Mankind during 1896, that in Micronesia, turmeric powder was applied for embellishment of body, clothing, utensils, and ceremonial uses.[36]"
  },
    {
    "category":"Spices",
    "name":"Ginger",
    "description":"The size of the seed ginger, called rhizome, is essential to the production of ginger. The larger the rhizome piece, the faster ginger will be produced and therefore the faster it will be sold onto the market.[30] Prior to planting the seed rhizomes, farmers are required to treat the seeds to prevent seed-borne pathogens and pests, rhizome rot and other seed-borne diseases.[30] There are various ways farmers do seed treatment in India. These include dipping the seeds in cow dung emulsion, smoking the seeds before storage, or hot water treatment.[30]Once the seeds are properly treated, the farmland in which they are to be planted must be thoroughly dug or ploughed by the farmer to break up the soil.[30] After the soil is sufficiently ploughed (at least 3-5 times), water channels are made 60–80 ft apart to irrigate the crop.[30]The next step is planting the rhizome seed. In India, planting the irrigated ginger crop is usually done in the months between March and June as those months account for the beginning of the monsoon, or rainy season.[30] Once the planting stage is done, farmers go on to mulch the crop to conserve moisture and check weed growth, as well as check surface run-off to conserve soil.[31] Mulching is done by applying mulch (green leaves for example) to the plant beds directly after planting and again 45 and 90 days into growth.[30] After mulching comes hilling, which is the stirring and breaking up of soil to check weed growth, break the firmness of the soil from rain, and conserve soil moisture.[30] Farmers must ensure that their ginger crops are receiving supplemental irrigation if rainfall is low in their region. In India, farmers must irrigate their ginger crops every two weeks at the least between September and November (when the monsoon is over) to ensure maximum yield and high quality product.The final farming stage for ginger is the harvesting stage and for items such as vegetable, soda, and candy, harvesting should be done between four and five months of planting, whereas when the rhizome is planted for products such as dried ginger or ginger oil, harvesting must be done eight to ten months after planting.[30]Dry ginger one of the most popular forms of ginger commercially exported, must undergo drying and preparation to reach the goal product.[32] Ginger rhizomes that are to be converted into dry ginger must be harvested at full maturity (8–10 months), then they must be soaked overnight and rubbed well for cleaning.[32] After being removed from water the outer skin is very delicately scraped off with a bamboo splinter or wooden knife and this process must be done by hand as it is too delicate a process to be done by machinery.[32] After being traded internationally, dried ginger is ground in the consuming centres to which they arrive.[33] Fresh ginger, another very popular form of exported ginger is not required to undergo further processing after being harvested, and can be harvested much sooner than dry ginger.[33]"
  },
    {
    "category":"Spices",
    "name":"Coriander",
    "description":"Coriander grows wild over a wide area of Western Asia and Southern Europe, prompting the comment: It is hard to define exactly where this plant is wild and where it only recently established itself.[14]Fifteen desiccated mericarps were found in the Pre-Pottery Neolithic B level of the Nahal Hemar Cave in Israel, which may be the oldest archaeological find of coriander.About half a litre of coriander mericarps was recovered from the tomb of Tutankhamen, and, because this plant does not grow wild in Egypt, Zohary and Hopf interpret this find as proof that coriander was cultivated by the ancient Egyptians.[14]The Ebers Papyrus, an Egyptian medical text dated to around 1550 BC, describes coriander's medicinal and culinary uses.[15]Coriander seems to have been cultivated in Greece since at least the second millennium BC. One of the Linear B tablets recovered from Pylos refers to the species as being cultivated for the manufacture of perfumes; it apparently was used in two forms: as a spice for its seeds and as a herb for the flavour of its leaves.[12]This appears to be confirmed by archaeological evidence from the same period; the large quantities of the species retrieved from an Early Bronze Age layer at Sitagroi in Macedonia could point to cultivation of the species at that time.[16]Later, coriander was mentioned by Hippocrates (c. 400 BC), as well as Dioscorides (65 AD).[15]"
  },
    {
    "category":"Spices",
    "name":"Anise",
    "description":"Anise was first cultivated in Egypt and the Middle East, and was brought to Europe for its medicinal value.[8] It has been cultivated in Egypt for approximately 4,000 years.[citation needed]Anise plants grow best in light, fertile, well-drained soil. The seeds should be planted as soon as the ground warms up in spring. Because the plants have a taproot, they do not transplant well after being established, so they should either be started in their final location or be transplanted while the seedlings are still small.[citation needed]Western cuisines have long used anise to flavor dishes, drinks, and candies. The word is used for both the species of herb and its licorice-like flavor. The most powerful flavor component of the essential oil of anise, anethole, is found in both anise and an unrelated spice indigenous to northern China[9] called star anise (Illicium verum) widely used in South Asian, Southeast Asian, and East Asian dishes. Star anise is considerably less expensive to produce, and has gradually displaced P. anisum in Western markets. While formerly produced in larger quantities, by 1999 world production of the essential oil of anise was only 8 tons, compared to 400 tons of star anise.[10]"
  },
    {
    "category":"Vegetables",
    "name":"Lemon",
    "description":"The origin of the lemon is unknown, though lemons are thought to have first grown in Assam (a region in northeast India), northern Burma or China.[2][failed verification] A genomic study of the lemon indicated it was a hybrid between bitter orange (sour orange) and citron.[3][4]Lemons entered Europe near southern Italy no later than the second century AD, during the time of Ancient Rome.[2] However, they were not widely cultivated. They were later introduced to Persia and then to Iraq and Egypt around 700 AD.[2] The lemon was first recorded in literature in a 10th-century Arabic treatise on farming, and was also used as an ornamental plant in early Islamic gardens.[2] It was distributed widely throughout the Arab world and the Mediterranean region between 1000 and 1150.[2] An article on Lemon and lime tree cultivation in Andalusia of Spain is brought down in Ibn al-'Awwam's 12th-century agricultural work, Book on Agriculture.[5]The first substantial cultivation of lemons in Europe began in Genoa in the middle of the 15th century. The lemon was later introduced to the Americas in 1493 when Christopher Columbus brought lemon seeds to Hispaniola on his voyages. Spanish conquest throughout the New World helped spread lemon seeds. It was mainly used as an ornamental plant and for medicine.[2] In the 19th century, lemons were increasingly planted in Florida and California.[2]In 1747, James Lind's experiments on seamen suffering from scurvy involved adding lemon juice to their diets, though vitamin C was not yet known as an important dietary ingredient.[2][6]The origin of the word lemon may be Middle Eastern.[2] The word draws from the Old French limon, then Italian limone, from the Arabic laymūn or līmūn, and from the Persian līmūn, a generic term for citrus fruit, which is a cognate of Sanskrit (nimbū, “lime”).Varieties"
  },
    {
    "category":"Vegetables",
    "name":"CickPeas",
    "description":"Chickpeas are usually rapidly boiled for 10 minutes and then simmered for a longer period. Dried chickpeas need a long cooking time (1–2 hours) but will easily fall apart when cooked longer. If soaked for 12–24 hours before use, cooking time can be shortened by around 30 minutes. Chickpeas can also be pressure cooked or sous vide cooked at 90 °C (194 °F).Mature chickpeas can be cooked and eaten cold in salads, cooked in stews, ground into flour, ground and shaped in balls and fried as falafel, made into a batter and baked to make farinata or cecina, or fried to make panelle. Chickpea flour is known as gram flour or besan in South Asia and used frequently in South Asian cuisine.In Portugal, chickpeas are one of the main ingredients in rancho, eaten with pasta and meat or with rice. They are used in other hot dishes with bacalhau and in soups, meat stews, and salads mixed with tuna and vegetables, olive oil, vinegar, hot pepper and salt. In Spain, they are used cold in tapas and salads, as well as in cocido madrileño.Hummus is the Arabic word for chickpeas, which are often cooked and ground into a paste and mixed with tahini (sesame seed paste), the blend called ḥummuṣ bi ṭaḥīna. Chickpeas are roasted, spiced, and eaten as a snack, such as leblebi. By the end of the 20th century, hummus had become commonplace in American cuisine.[22] By 2010, 5% of Americans consumed hummus on a regular basis,[22] and it was present at some point in 17% of American households.[23]Chickpeas and Bengal grams are used to make curries and are one of the most popular vegetarian foods in the Indian subcontinent and in diaspora communities of many other countries served with variety of breads or steamed rice. Popular dishes in Indian cuisine are made with chickpea flour, such as mirchi bajji and mirapakaya bajji. In India, as well as in the Levant, unripe chickpeas are often picked out of the pod and eaten as a raw snack and the leaves are eaten as a leaf vegetable in salads. In India, desserts such as besan halwa and sweets such as mysore pak, besan barfi and laddu are made.[citation needed]Chickpea flour is used to make Burmese tofu which was first known among the Shan people of Burma. In South Asian cuisine the chickpea flour (besan) is used as a batter to coat vegetables before deep frying to make pakoras. The flour is also used as a batter to coat vegetables and meats before frying, or fried alone such as panelle (little bread), a chickpea fritter from Sicily. Chickpea flour is used to make the Mediterranean flatbread socca and called panisse in Provence, southern France. It is made of cooked chickpea flour, poured into saucers, allowed to set, cut in strips, and fried in olive oil, often eaten during Lent. In Tuscany chickpea flour (farina di ceci) is used to make an oven baked pancake: the flour is mixed with water, oil and salt. Chickpea flour known as kadlehittu in Kannada is used for making sweet dish Mysorepak.In the Philippines, chickpeas preserved in syrup are eaten as sweets and in desserts such as halo-halo. Jews from Ashkenazi countries traditionally serve whole chickpeas at a Shalom Zachar celebration for baby boys.Guasanas or garbanza is a Mexican chickpea street snack. The beans, while still green, are cooked in water and salt, kept in a steamer to maintain their humidity, and served in a plastic bag.A chickpea-derived liquid (aquafaba) can be used as an egg white replacement to make meringue[24] or ice cream, with the residual pomace used as flour.[25]"
  },
    {
    "category":"Vegetables",
    "name":"Okra",
    "description":"The species is a perennial, often cultivated as an annual in temperate climates, often growing to around 2 metres (6.6 ft) tall. As a member of the Malvaceae, it is related to such species as cotton, cocoa, and hibiscus. The leaves are 10–20 centimetres (3.9–7.9 in) long and broad, palmately lobed with 5–7 lobes. The flowers are 4–8 centimetres (1.6–3.1 in) in diameter, with five white to yellow petals, often with a red or purple spot at the base of each petal. The pollens are spherical with approximately 188 microns diameter. The fruit is a capsule up to 18 centimetres (7.1 in) long with pentagonal cross-section, containing numerous seeds.Abelmoschus esculentus is cultivated throughout the tropical and warm temperate regions of the world for its fibrous fruits or pods containing round, white seeds. It is among the most heat- and drought-tolerant vegetable species in the world and will tolerate soils with heavy clay and intermittent moisture, but frost can damage the pods. In cultivation, the seeds are soaked overnight prior to planting to a depth of 1–2 centimetres (0.39–0.79 in). It prefers a soil temperature of at least 20 °C (68 °F) for germination, which occurs between six days (soaked seeds) and three weeks. As a tropical plant, it also requires a lot of sunlight, and it should also be cultivated in soil that has a pH between 5.8 and 7, ideally on the acidic side.[15] Seedlings require ample water. The seed pods rapidly become fibrous and woody and, to be edible as a vegetable, must be harvested when immature, usually within a week after pollination.[16] The first harvesting will typically be ready after about 2 months of plantation, and it will be approximately 2-3 inches long.[15]The most common disease afflicting the okra plant is verticillium wilt, often causing a yellowing and wilting of the leaves. Other diseases include powdery mildew in dry tropical regions, leaf spots, yellow mosaic and root-knot nematodes. Resistance to yellow mosaic virus in A. esculentus was transferred through a cross with Abelmoschus manihot and resulted in a new variety called Parbhani kranti.[17]"
  },
    {
    "category":"Vegetables",
    "name":"Potatoes",
    "description":"Potato plants are herbaceous perennials that grow about 60 cm (24 in) high, depending on variety, with the leaves dying back after flowering, fruiting and tuber formation. They bear white, pink, red, blue, or purple flowers with yellow stamens. Potatoes are mostly cross-pollinated by insects such as bumblebees, which carry pollen from other potato plants, though a substantial amount of self-fertilizing occurs as well. Tubers form in response to decreasing day length, although this tendency has been minimized in commercial varieties.[19]After flowering, potato plants produce small green fruits that resemble green cherry tomatoes, each containing about 300 seeds. Like all parts of the plant except the tubers, the fruit contain the toxic alkaloid solanine and are therefore unsuitable for consumption. All new potato varieties are grown from seeds, also called true potato seed, TPS or botanical seed to distinguish it from seed tubers. New varieties grown from seed can be propagated vegetatively by planting tubers, pieces of tubers cut to include at least one or two eyes, or cuttings, a practice used in greenhouses for the production of healthy seed tubers. Plants propagated from tubers are clones of the parent, whereas those propagated from seed produce a range of different varieties"
  },
    {
    "category":"Vegetables",
    "name":"Tomatoes",
    "description":"Tomato plants are vines, initially decumbent, typically growing 180 cm (6 ft) or more above the ground if supported, although erect bush varieties have been bred, generally 100 cm (3 ft 3 in) tall or shorter. Indeterminate types are tender perennials, dying annually in temperate climates (they are originally native to tropical highlands), although they can live up to three years in a greenhouse in some cases. Determinate types are annual in all climates.[citation needed]Tomato plants are dicots, and grow as a series of branching stems, with a terminal bud at the tip that does the actual growing. When that tip eventually stops growing, whether because of pruning or flowering, lateral buds take over and grow into other, fully functional, vines.[10]Tomato vines are typically pubescent, meaning covered with fine short hairs. These hairs facilitate the vining process, turning into roots wherever the plant is in contact with the ground and moisture, especially if the vine's connection to its original root has been damaged or severed.[citation needed]Most tomato plants have compound leaves, and are called regular leaf (RL) plants, but some cultivars have simple leaves known as potato leaf (PL) style because of their resemblance to that particular relative. Of RL plants, there are variations, such as rugose leaves, which are deeply grooved, and variegated, angora leaves, which have additional colors where a genetic mutation causes chlorophyll to be excluded from some portions of the leaves.[11]The leaves are 10–25 cm (4–10 in) long, odd pinnate, with five to nine leaflets on petioles,[12] each leaflet up to 8 cm (3 in) long, with a serrated margin; both the stem and leaves are densely glandular-hairy.[citation needed]Their flowers, appearing on the apical meristem, have the anthers fused along the edges, forming a column surrounding the pistil's style. Flowers in domestic cultivars can be self-fertilizing. The flowers are 1–2 cm (1⁄2–3⁄4 in) across, yellow, with five pointed lobes on the corolla; they are borne in a cyme of three to 12 together.[citation needed]Although in culinary terms, tomato is regarded as a vegetable, its fruit is classified botanically as a berry.[13] As a true fruit, it develops from the ovary of the plant after fertilization, its flesh comprising the pericarp walls. The fruit contains hollow spaces full of seeds and moisture, called locular cavities. These vary, among cultivated species, according to type. Some smaller varieties have two cavities, globe-shaped varieties typically have three to five, beefsteak tomatoes have a great number of smaller cavities, while paste tomatoes have very few, very small cavities.[14][15][16]For propagation, the seeds need to come from a mature fruit, and be dried or fermented before germination"
  },
    {
    "category":"Vegetables",
    "name":"Cabbage",
    "description":"Cabbage seedlings have a thin taproot and cordate (heart-shaped) cotyledons. The first leaves produced are ovate (egg-shaped) with a lobed petiole. Plants are 40–60 cm (16–24 in) tall in their first year at the mature vegetative stage, and 1.5–2.0 m (4 ft 11 in–6 ft 7 in) tall when flowering in the second year.[13] Heads average between 0.5 and 4 kg (1 and 8 lb), with fast-growing, earlier-maturing varieties producing smaller heads.[14] Most cabbages have thick, alternating leaves, with margins that range from wavy or lobed to highly dissected; some varieties have a waxy bloom on the leaves. Plants have root systems that are fibrous and shallow.[9] About 90 percent of the root mass is in the upper 20–30 cm (8–12 in) of soil; some lateral roots can penetrate up to 2 m (6 ft 7 in) deep.[13]The inflorescence is an unbranched and indeterminate terminal raceme measuring 50–100 cm (20–40 in) tall,[13] with flowers that are yellow or white. Each flower has four petals set in a perpendicular pattern, as well as four sepals, six stamens, and a superior ovary that is two-celled and contains a single stigma and style. Two of the six stamens have shorter filaments. The fruit is a silique that opens at maturity through dehiscence to reveal brown or black seeds that are small and round in shape. Self-pollination is impossible, and plants are cross-pollinated by insects.[9] The initial leaves form a rosette shape comprising 7 to 15 leaves, each measuring 25–35 cm (10–14 in) by 20–30 cm (8–12 in);[13] after this, leaves with shorter petioles develop and heads form through the leaves cupping inward.[2]Many shapes, colors and leaf textures are found in various cultivated varieties of cabbage. Leaf types are generally divided between crinkled-leaf, loose-head savoys and smooth-leaf firm-head cabbages, while the color spectrum includes white and a range of greens and purples. Oblate, round and pointed shapes are found.[15]Cabbage has been selectively bred for head weight and morphological characteristics, frost hardiness, fast growth and storage ability. The appearance of the cabbage head has been given importance in selective breeding, with varieties being chosen for shape, color, firmness and other physical characteristics.[16] Breeding objectives are now focused on increasing resistance to various insects and diseases and improving the nutritional content of cabbage.[17] Scientific research into the genetic modification of B. oleracea crops, including cabbage, has included European Union and United States explorations of greater insect and herbicide resistance.[18]There are several Guinness Book of World Records entries related to cabbage. These include the heaviest cabbage, at 62.71 kg (138 lb 4 oz),[19] heaviest red cabbage, at 31.6 kilograms (69 lb 11 oz),[20] longest cabbage roll, at 19.54 m (64 ft 1+1⁄2 in),[21] and the largest cabbage dish, at 2,960 kg (6,526 lb).[22]"
  },
    {
    "category":"Vegetables",
    "name":"Onion",
    "description":"The onion plant has been grown and selectively bred in cultivation for at least 7,000 years. It is a biennial plant, but is usually grown as an annual. Modern varieties typically grow to a height of 15 to 45 cm (6 to 18 in). The leaves are yellowish- to bluish green and grow alternately in a flattened, fan-shaped swathe. They are fleshy, hollow, and cylindrical, with one flattened side. They are at their broadest about a quarter of the way up, beyond which they taper towards a blunt tip. The base of each leaf is a flattened, usually white sheath that grows out of the basal plate of a bulb. From the underside of the plate, a bundle of fibrous roots extends for a short way into the soil. As the onion matures, food reserves begin to accumulate in the leaf bases and the bulb of the onion swells.[15]In the autumn, the leaves die back and the outer scales of the bulb become dry and brittle, so the crop is then normally harvested. If left in the soil over winter, the growing point in the middle of the bulb begins to develop in the spring. New leaves appear and a long, stout, hollow stem expands, topped by a bract protecting a developing inflorescence. The inflorescence takes the form of a globular umbel of white flowers with parts in sixes. The seeds are glossy black and triangular in cross section.[15] The average pH of an onion is"
  },
    {
    "category":"Nuts",
    "name":"Cashew",
    "description":"In 2014, rapid growth of cashew cultivation in Ivory Coast made this country the top African exporter.[27] Fluctuations in world market prices, poor working conditions, and low pay for local harvesting have caused discontent in the cashew nut industry.[28][29][30]The cashew tree is cultivated in the tropics between 25°N and 25°S, and is well-adapted to hot lowland areas with a pronounced dry season, where the mango and tamarind trees also thrive.[31] The traditional cashew tree is tall (up to 14 m) and takes three years from planting before it starts production, and eight years before economic harvests can begin. More recent breeds, such as the dwarf cashew trees, are up to 6 m tall, and start producing after the first year, with economic yields after three years. The cashew nut yields for the traditional tree are about 0.25 metric tons per hectare, in contrast to over a ton per hectare for the dwarf variety. Grafting and other modern tree management technologies are used to further improve and sustain cashew nut yields in commercial"
  },
    {
    "category":"Nuts",
    "name":"GroundNut",
    "description":"Peanuts grow best in light, sandy loam soil with a pH of 5.9–7. Their capacity to fix nitrogen means that, providing they nodulate properly, peanuts benefit little or not at all from nitrogen-containing fertilizer,[18] and they improve soil fertility. Therefore, they are valuable in crop rotations. Also, the yield of the peanut crop itself is increased in rotations, through reduced diseases, pests and weeds. For example, in Texas, peanuts in a three-year rotation with corn yield 50% more than nonrotated peanuts.[18] Adequate levels of phosphorus, potassium, calcium, magnesium, and micronutrients are also necessary for good yields.[18] To develop well, peanuts need warm weather throughout the growing season. They can be grown with as little as 350 mm (14 in) of water,[19] but for best yields need at least 500 mm (20 in).[20] Depending on growing conditions and the cultivar of peanut, harvest is usually 90 to 130 days after planting for subspecies A. h. fastigiata types, and 120 to 150 days after planting for subspecies A. h. hypogaea types.[19][21][22] Subspecies A. h. hypogaea types yield more, and are usually preferred where the growing seasons are sufficiently long.Peanut plants continue to produce flowers when pods are developing; therefore even when they are ready for harvest, some pods are immature. In order to maximize yield, the timing of harvest is important. If it is too early, too many pods will be unripe; if too late, the pods will snap off at the stalk, and will remain in the soil.[23] For harvesting, the entire plant, including most of the roots, is removed from the soil.[23] The pods are covered with a network of raised veins and are constricted between seeds.The main yield limiting factors in semiarid regions are drought and high temperature stress. The stages of reproductive development prior to flowering, at flowering and at early pod development, are particularly sensitive to these constraints. Apart from N, P and K, other nutrient deficiencies causing significant yield losses are Ca, Fe and B. Biotic stresses mainly include pests, diseases and weeds. Among insects pests pod borers, aphids and mites are of importance. The most important diseases are leaf spots, rusts and the toxin-producing fungus Aspergillus.[24]Harvesting occurs in two stages.[25][self-published source?] In mechanized systems, a machine is used to cut off the main root of the peanut plant by cutting through the soil just below the level of the peanut pods. The machine lifts the bush from the ground and shakes it, then inverts the bush, leaving the plant upside down on the ground to keep the peanuts out of the soil. This allows the peanuts to dry slowly to a little less than a third of their original moisture level over a period of three to four days. Traditionally, peanuts were pulled and inverted by hand.=After the peanuts have dried sufficiently, they are threshed, removing the peanut pods from the rest of the bush.[23] It is particularly important that peanuts are dried properly and stored in dry conditions. If they are too high in moisture, or if storage conditions are poor, they may become infected by the mold fungus Aspergillus flavus. Many strains of this fungus release toxic and highly carcinogenic substances called aflatoxins."
  },
    {
    "category":"Pulses",
    "name":"Safflower",
    "description":"Safflower prefers high temperatures and grows best at 28-35 °C . It tolerates 40 °C but there are also some varieties which grow under very low temperatures.[7] Safflower is cultivated in different seasons: as a winter crop in south central India, as an early summer crop in California and as a mid-summer crop in the Northern Great Plains of the United States.[8] Minimum length of the growing season is 120 and 200 days for summer and winter cultivars, respectively.[9] Plant performance is highly dependent on the different planting dates in terms of temperature and day length.[8] Winter hard varieties only form a rosette in late fall and elongates in spring.[8] In early stages, safflower tolerates humidity but after bud stage the danger of a Botrytis blight infestation increases[8]Safflower is drought tolerant.[10] The tap root makes moisture from deep soil layers available.[8] Additionally, this tolerance can also be explained by the higher water use efficiency compared to other oil crops such as linseed and mustard.[11] Shortly before and during maximum flowering water requirements are the highest.[8] Beside drought tolerance, all parts of the plant are sensitive to moisture in terms of diseases.[8] In the case of excessive water supply, it is susceptible to root rot.[8] Therefore, many varieties are not suitable in irrigated agriculture especially on soils with danger of waterlogging.[9]Safflower tolerates wind and hail better than cereals.[12] It stays erect and can retain the seeds in the head.[8]"
  },
    {
    "category":"Pulses",
    "name":"Caster oil Seeds",
    "description":"Castor oil is well known as a source of ricinoleic acid, a monounsaturated, 18-carbon fatty acid. Among fatty acids, ricinoleic acid is unusual in that it has a hydroxyl functional group on the 12th carbon. This functional group causes ricinoleic acid (and castor oil) to be more polar than most fats. The chemical reactivity of the alcohol group also allows chemical derivatization that is not possible with most other seed oils. Because of its ricinoleic acid content, castor oil is a valuable chemical in feedstocks, commanding a higher price than other seed oils. As an example, in July 2007, Indian castor oil sold for about US$0.90/kg ($0.41/lb),[citation needed] whereas U.S. soybean, sunflower, and canola oils sold for about $0.30/kg ($0.14/lb).[7]"
  },
    {
    "category":"Pulses",
    "name":"Cotton",
    "description":"Successful cultivation of cotton requires a long frost-free period, plenty of sunshine, and a moderate rainfall, usually from 60 to 120 cm (24 to 47 in)[citation needed]. Soils usually need to be fairly heavy, although the level of nutrients does not need to be exceptional. In general, these conditions are met within the seasonally dry tropics and subtropics in the Northern and Southern hemispheres, but a large proportion of the cotton grown today is cultivated in areas with less rainfall that obtain the water from irrigation. Production of the crop for a given year usually starts soon after harvesting the preceding autumn. Cotton is naturally a perennial but is grown as an annual to help control pests.[52] Planting time in spring in the Northern hemisphere varies from the beginning of February to the beginning of June. The area of the United States known as the South Plains is the largest contiguous cotton-growing region in the world. While dryland (non-irrigated) cotton is successfully grown in this region, consistent yields are only produced with heavy reliance on irrigation water drawn from the Ogallala Aquifer. Since cotton is somewhat salt and drought tolerant, this makes it an attractive crop for arid and semiarid regions. As water resources get tighter around the world, economies that rely on it face difficulties and conflict, as well as potential environmental problems.[53][54][55][56][57] For example, improper cropping and irrigation practices have led to desertification in areas of Uzbekistan, where cotton is a major export. In the days of the Soviet Union, the Aral Sea was tapped for agricultural irrigation, largely of cotton, and now salination is widespread.[56][57]Cotton can also be cultivated to have colors other than the yellowish off-white typical of modern commercial cotton fibers. Naturally colored cotton can come in red, green, and several shades of brown.[58]"
  },
    {
    "category":"Pulses",
    "name":"Lentil",
    "description":"The cultivated lentil Lens culinaris subsp. culinaris was derived from its wild subspecies L. culinaris subsp. orientalis, although other species may also have contributed some genes, according to Jonathan Sauer (Historical Geography of Crop Plants, 2017.)[13] Unlike their wild ancestors, domesticated lentil crops have indehiscent pods and non-dormant seeds.[13]Lentil was domesticated in the Fertile Crescent of the Near East and then spread to Europe, the Middle East, North Africa and the Indo-Gangetic plain. The primary center of diversity for the domestic Lens culinaris as well as its wild progenitor L. culinaris ssp. orientalis is considered to be the Middle East. The oldest known carbonized remains of lentil from Greece's Franchthi Cave are dated to 11,000 BC. In archaeobotanical excavations carbonized remains of lentil seeds have been recovered from widely dispersed places such as Tell Ramad in Syria (6250-5950 BC), Aceramic Beidha in Jordan, Hacilar in Turkey (5800-5000 BC), Tepe Sabz (Ita. Tepe Sabz) in Iran (5500-5000 BC) and Argissa-Magula Tessaly in Greece (6000-5000 BC), along other places.[14]"
  },
    {
    "category":"Pulses",
    "name":"Fennel",
    "description":"Fennel is widely cultivated, both in its native range and elsewhere, for its edible, strongly flavored leaves and fruits. Its aniseed or liquorice flavor[13] comes from anethole, an aromatic compound also found in anise and star anise, and its taste and aroma are similar to theirs, though usually not as strong.[14]Florence fennel (Foeniculum vulgare Azoricum Group; syn. F. vulgare var. azoricum) is a cultivar group with inflated leaf bases which form a bulb-like structure. It is of cultivated origin,[15] and has a mild anise-like flavor, but is sweeter and more aromatic. Florence fennel plants are smaller than the wild type.[16] Several cultivars of Florence fennel are also known by several other names, notably the Italian name finocchio. In North American supermarkets, it is often mislabeled as anise.[17][18]Foeniculum vulgare 'Purpureum' or 'Nigra', bronze-leaved fennel, is widely available as a decorative garden plant.[19]Fennel has become naturalized along roadsides, in pastures, and in other open sites in many regions, including northern Europe, the United States, southern Canada, and much of Asia and Australia. It propagates well by seed, and is considered an invasive species and a weed in Australia[20] and the United States. In western North America, fennel can be found from the coastal and inland wildland-urban interface east into hill and mountain areas, excluding desert habitats.[21][22]"
  }
]
